![png](Data/books_ERD.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine 
from sqlalchemy_utils import database_exists, create_database
import pymysql 
from urllib.parse import quote_plus
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
username = "root"
password = "6236265.Scz" 

db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists')
else:
    create_databse(connection)
    print ('Database created')

It exists

In [4]:
q= '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1    authors_data
2           books
3       favorites
4           users

In [5]:
q = '''DESCRIBE books;'''
pd.read_sql(q, conn)

   Field         Type Null  Key Default Extra
0     id          int   NO  PRI    None
1  title  varchar(45)  YES         None

In [6]:
q = '''DESCRIBE users;'''
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [7]:
q = '''DESCRIBE favorites;'''
pd.read_sql(q, conn)

      Field Type Null  Key Default Extra
0  users_id  int   NO  PRI    None
1  books_id  int  YES         None

In [8]:
q= '''SELECT * FROM authors'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, author_name, books_id]
Index: []

In [9]:
q= '''SELECT * FROM books'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, title]
Index: []

In [10]:
q= '''SELECT * FROM favorites'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [users_id, books_id]
Index: []

In [22]:
q= '''SELECT * FROM users'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, first_name, last_name, email]
Index: []

AUTHORS

In [12]:
authors= pd.read_csv('Data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [13]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None
2     books_id          int   NO  PRI    None

In [14]:
describe['Field'].values

array(['id', 'author_name', 'books_id'], dtype=object)

In [15]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [16]:
authors.to_sql("authors_data",conn,index=False, if_exists='append')

5

In [23]:
q = '''
SELECT * FROM authors_data
'''
pd.read_sql(q, conn)

    id        author_name
0    1       Stephen King
1    2  F.Scott Fitgerald
2    3        Jack London
3    4        Jane Austen
4    5       Mary Shelley
5    1       Stephen King
6    2  F.Scott Fitgerald
7    3        Jack London
8    4        Jane Austen
9    5       Mary Shelley
10   1       Stephen King
11   2  F.Scott Fitgerald
12   3        Jack London
13   4        Jane Austen
14   5       Mary Shelley

BOOKS

In [24]:
books = pd.read_csv('Data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [25]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

   Field         Type Null  Key Default Extra
0     id          int   NO  PRI    None
1  title  varchar(45)  YES         None

In [28]:
books.to_sql("books_data",conn,index=False, if_exists='append')

6

In [30]:
q = '''
SELECT * FROM books_data
'''
pd.read_sql(q, conn)

    id                 title  author_id
0    1           The Shining          1
1    2                    It          1
2    3      The Great Gatsby          2
3    4  The Call of the Wild          3
4    5   Pride and Prejudice          4
5    6          Frankenstein          5
6    1           The Shining          1
7    2                    It          1
8    3      The Great Gatsby          2
9    4  The Call of the Wild          3
10   5   Pride and Prejudice          4
11   6          Frankenstein          5

USERS

In [31]:
users = pd.read_csv('Data/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [32]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [33]:
users.to_sql("users_data",conn,index=False, if_exists='append')

3

In [35]:
q = '''
SELECT * FROM users_data
'''
pd.read_sql(q, conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

FAVORITES

In [36]:
favorites = pd.read_csv('Data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [38]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default Extra
0  users_id  int   NO  PRI    None
1  books_id  int  YES         None

In [39]:
favorites.to_sql("favorites_data",conn,index=False, if_exists='append')

7

In [44]:
q= '''SELECT books_data.title, favorites_data.user_id
FROM books_data
JOIN favorites_data ON books_data.id = favorites_data.book_id
WHERE favorites_data.user_id = 
    (SELECT users_data.id FROM users_data WHERE (users_data.last_name = "Doe" AND users_data.first_name = "John"));'''
pd.read_sql(q, conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1
3       The Shining        1
4                It        1
5  The Great Gatsby        1